Revit 2026 API

# OutlineMaximumPoint Property

---

The maximum point of the bounding box.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ MaximumPoint { get; set; }
```
```vb
Public Property MaximumPoint As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ MaximumPoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member MaximumPoint : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Outline Class

Autodesk.Revit.DB Namespace